import React from 'react';

export default function Term3() {
  return (
    <section>
      <h1>lookids(루키즈) 위치기반 서비스 이용약관</h1>
      <h2>제 1 조 (목적)</h2>
      <p>
        본 약관은 회사가 제공하는 위치기반 서비스의 이용과 관련하여 회사와 회원
        간의 권리 및 의무를 규정함을 목적으로 합니다.
      </p>
      <h2>제 2 조 (위치정보의 수집 항목 및 이용)</h2>
      <p>
        회사는 GPS, Wi-Fi, 모바일 데이터 등 다양한 방법을 통해 회원의 위치정보를
        수집하며, 이를 기반으로 맞춤형 콘텐츠를 제공합니다. 회원은 피드를 작성할
        때 위치정보를 추가할 수 있습니다.
      </p>
      <h2>제 3 조 (위치정보의 보호)</h2>
      <p>
        회사는 위치정보 보호법에 따라 위치정보를 보호하며, 외부에 제공하지
        않습니다. 단, 회원의 동의를 받은 경우 또는 법적 요구가 있을 경우에는
        예외로 합니다.
      </p>
      <h2>제 4 조 (회원의 권리)</h2>
      <p>
        회원은 위치정보 제공 동의를 언제든지 철회할 수 있으며, 위치기반 서비스
        이용 중지 요청을 할 수 있습니다.
      </p>
      <h2>제 5 조 (위치정보 보유 및 이용 기간)</h2>
      <p>
        위치정보는 서비스 제공 목적을 달성한 후 지체 없이 파기합니다. 단,
        법령에서 정한 기간 동안 보관할 수 있습니다.
      </p>
      <h2>제 6 조 (분쟁 해결)</h2>
      <p>
        회사는 위치기반 서비스 이용과 관련된 분쟁 발생 시 회원과 협의하여
        해결합니다.
      </p>
    </section>
  );
}
