import './styles.css';

import React from 'react';

export default function Term1() {
  return (
    <section>
      <h1>lookids(루키즈) 이용 약관</h1>
      <h2>제 1 조 (목적)</h2>
      <p>
        본 약관은 lookids (이하 "서비스")가 제공하는 SNS 서비스의 이용과
        관련하여 회사와 회원 간의 권리, 의무 및 책임 사항을 규정함을 목적으로
        합니다.
      </p>

      <h2>제 2 조 (서비스의 정의)</h2>
      <p>
        "서비스"란 회사가 제공하는 lookids SNS 서비스로, 사용자가 콘텐츠를 생성,
        공유하고, 채팅 기능을 통해 소통할 수 있는 플랫폼을 의미합니다.
      </p>

      <h2>제 3 조 (약관의 효력과 변경)</h2>
      <p>
        회사는 필요 시 본 약관을 변경할 수 있으며, 변경된 약관은 서비스 내
        공지하거나 이메일로 통지함으로써 효력이 발생합니다. 회원은 약관 변경
        후에도 서비스를 계속 이용할 경우 변경된 약관에 동의한 것으로 간주됩니다.
      </p>

      <h2>제 4 조 (회원 가입과 자격)</h2>
      <ol>
        <li>
          회원 가입은 회사가 제공하는 가입 양식을 작성하고 본 약관에
          동의함으로써 이루어집니다.
        </li>
        <li>
          회사는 특정 이용자가 서비스 이용 자격을 제한할 수 있는 권한을
          보유합니다.
        </li>
      </ol>

      <h2>제 5 조 (회원의 의무)</h2>
      <p>회원은 다음과 같은 행위를 해서는 안 됩니다:</p>
      <ul>
        <li>타인의 개인정보 도용 및 허위 정보 제공</li>
        <li>서비스 운영 방해 및 회사의 지적 재산권 침해</li>
        <li>
          위치 정보를 허위로 제공하거나 타인의 위치정보를 무단으로 이용하는 행위
        </li>
        <li>기타 불법적인 행위</li>
      </ul>

      <h2>제 6 조 (콘텐츠의 권리)</h2>
      <p>
        회원이 생성한 콘텐츠의 저작권은 회원에게 있으며, 회원은 회사에 대해 해당
        콘텐츠의 이용을 위한 비독점적, 무상, 양도 불가능한 라이센스를
        부여합니다.
      </p>

      <h2>제 7 조 (서비스 중단)</h2>
      <p>
        회사는 서비스의 운영상, 기술상 이유로 서비스 제공을 일시 중단할 수
        있으며, 이를 회원에게 사전 공지합니다.
      </p>

      <h2>제 8 조 (책임의 제한)</h2>
      <p>
        회사는 천재지변, 정전, 해킹 등 불가피한 사유로 인한 서비스 중단 및
        손해에 대해 책임지지 않습니다.
      </p>

      <h2>제 9 조 (분쟁 해결)</h2>
      <p>
        본 약관과 관련된 분쟁이 발생할 경우, 회사와 회원은 상호 협의하여
        해결하도록 노력합니다. 협의가 이루어지지 않을 경우, 관할 법원은 회사의
        본사 소재지로 합니다.
      </p>
    </section>
  );
}
