import React from "react";

export default function Term2() {
  return (
    <section>
      <h2>제 1 조 (수집하는 개인정보 항목)</h2>
      <p>회사는 다음과 같은 항목의 개인정보를 수집합니다:</p>
      <ol>
        <li>필수 항목: 이름, 연락처, 이메일, 비밀번호</li>
        <li>선택 항목: 프로필 사진, 위치 정보</li>
        <li>서비스 이용 시 수집: 작성한 게시글, 댓글, 채팅 내용</li>
      </ol>
      <h2>제 2 조 (개인정보 수집 및 이용 목적)</h2>
      <p>회사는 수집된 개인정보를 아래와 같은 목적으로 사용합니다:</p>
      <ul>
        <li>회원 관리 및 본인 확인</li>
        <li>서비스 제공 및 유지, 개선</li>
        <li>이벤트 및 프로모션 안내</li>
        <li>서비스 이용 통계 분석 및 맞춤형 서비스 제공</li>
      </ul>
      <h2>제 3 조 (개인정보 보유 및 이용 기간)</h2>
      <p>
        회사는 개인정보의 수집 목적이 달성된 후, 지체 없이 이를 파기합니다. 단,
        관계 법령에 의해 보관이 필요한 경우 법령에서 정한 기간 동안 보관합니다.
      </p>
      <h2>제 4 조 (개인정보의 제3자 제공)</h2>
      <p>
        회사는 회원의 개인정보를 외부에 제공하지 않으나, 법적 요구 시 제공할 수
        있습니다.
      </p>
      <h2>제 5 조 (개인정보 보호를 위한 조치)</h2>
      <p>
        회사는 개인정보의 안전성을 위해 다양한 보호 조치를 시행합니다. (예:
        데이터 암호화, 접근 제한 등)
      </p>
      <h2>제 6 조 (회원의 권리)</h2>
      <p>
        회원은 자신의 개인정보에 대한 열람, 정정, 삭제를 요청할 수 있으며,
        회사는 지체 없이 이를 처리합니다.
      </p>
    </section>
  );
}
